[
  {
    "src": "/assets/images/blobism.jpg",
    "shortDescription": "KochiPlaza Constructions specializes in residential construction across Kochi, Ernakulam, and all Kerala districts. From luxury villas to affordable homes, we deliver dream homes with superior craftsmanship and modern design.",
    "longDescription": "As a trusted construction company in Kochi, KochiPlaza Constructions offers comprehensive residential construction services across all districts of Kerala including Kasaragod, Kannur, Wayanad, Kozhikode, Malappuram, Palakkad, Thrissur, Ernakulam, Idukki, Kottayam, Alappuzha, Pathanamthitta, Kollam, and Thiruvananthapuram. Our expert team of builders in Ernakulam brings your vision to life with meticulous attention to detail, quality materials, and innovative architectural solutions. Whether you're planning a luxury home in Kochi or an affordable house construction in Kerala, we provide end-to-end residential building services tailored to your needs and budget.",
    "title": "Residential Construction",
    "genre": "House Construction",
    "color": "#011936",
    "author": "KochiPlaza Team"
  },
  {
    "src": "/assets/images/brutalism.jpg",
    "shortDescription": "Leading commercial builders in Kochi, we construct office complexes, retail spaces, and commercial buildings across Kerala. Our expertise ensures functional, aesthetically pleasing spaces that drive business success.",
    "longDescription": "KochiPlaza Constructions stands as one of the best construction companies in Kerala for commercial projects. Our commercial building services span across Kochi, Ernakulam, and all Kerala districts, delivering state-of-the-art office buildings, shopping complexes, warehouses, and mixed-use developments. As experienced building contractors in Kochi, we understand the unique requirements of commercial construction—from regulatory compliance to timeline management. Our pan-Kerala construction services ensure businesses across Kasaragod to Thiruvananthapuram receive world-class commercial infrastructure built with precision, durability, and modern design principles.",
    "title": "Commercial Construction",
    "genre": "Commercial Buildings",
    "color": "#00A390",
    "author": "KochiPlaza Team"
  },
  {
    "src": "/assets/images/high-tech.jpg",
    "shortDescription": "Offering complete turnkey construction services in Kochi and across Kerala, we handle every aspect from design to handover. Experience hassle-free construction with our comprehensive project management.",
    "longDescription": "KochiPlaza Constructions provides turnkey construction solutions across all districts of Kerala, making us the preferred choice for clients seeking a single-point contact for their construction needs. Our turnkey construction in Kerala covers architectural design, structural engineering, procurement, construction, and interior finishing. As a trusted construction company in Kochi with two physical locations in Ernakulam, we serve clients from Kasaragod in the north to Thiruvananthapuram in the south. Our comprehensive approach ensures seamless project execution, cost efficiency, and timely delivery, whether you're building a residential home or a commercial complex anywhere in Kerala.",
    "title": "Turnkey Projects",
    "genre": "Complete Solutions",
    "color": "#eeadad",
    "author": "KochiPlaza Team"
  },
  {
    "src": "/assets/images/metabolism.jpg",
    "shortDescription": "Expert renovation and remodeling services in Kochi and throughout Kerala. We transform existing spaces into modern, functional environments while preserving structural integrity and enhancing property value.",
    "longDescription": "As experienced builders in Ernakulam, KochiPlaza Constructions offers professional renovation and remodeling services across all Kerala districts. Whether it's updating a heritage home in Kochi, modernizing an office in Thrissur, or expanding a residence in Thiruvananthapuram, our renovation expertise brings new life to existing structures. Our Kerala-wide renovation services include structural modifications, interior redesign, facade updates, and complete property makeovers. We combine traditional craftsmanship with modern techniques to deliver renovations that respect the original character while meeting contemporary standards of comfort and functionality.",
    "title": "Renovation Services",
    "genre": "Remodeling",
    "color": "#adb5ee",
    "author": "KochiPlaza Team"
  },
  {
    "src": "/assets/images/modernist.jpg",
    "shortDescription": "Premium interior design and finishing services across Kochi and Kerala. We create beautiful, functional interiors that reflect your style and enhance your living or working environment.",
    "longDescription": "KochiPlaza Constructions, a leading construction company in Kochi, offers exceptional interior design and finishing services throughout Kerala. Our interior solutions cover residential and commercial spaces across all districts—from luxury home interiors in Kochi to corporate office designs in Ernakulam and beyond. As trusted builders in Ernakulam with pan-Kerala service coverage, we provide comprehensive interior services including space planning, custom furniture, modular kitchens, false ceilings, flooring, lighting design, and complete turnkey interior solutions. Our design team combines aesthetic excellence with practical functionality to create interiors that stand the test of time across Kasaragod, Kannur, Wayanad, Kozhikode, Malappuram, Palakkad, Thrissur, Idukki, Kottayam, Alappuzha, Pathanamthitta, Kollam, and Thiruvananthapuram.",
    "title": "Interior Design",
    "genre": "KochiPlaza Constructions",
    "color": "#58315B",
    "author": "KochiPlaza Team"
  }
]